IDEA Open Model
ArcSegment3D Class
Compatible with IDEA StatiCa 20.1
 Represents an arc segment in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Segment3D
 IdeaRS.OpenModel.Geometry3D.ArcSegment3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ArcSegment3D : Segment3D
Public Class ArcSegment3D
	Inherits Segment3D
The ArcSegment3D type exposes the following members.
Constructors
Name | Description
ArcSegment3D
Initializes a new instance of the ArcSegment3D class
Top
Properties
Name | Description
EndPoint
 Gets or sets the reference to Point3D endpoint of the segment.
 (Inherited from Segment3D.)
Id
 Element Id
 (Inherited from OpenElementId.)
LocalCoordinateSystem
 Local coordinate system
 (Inherited from Segment3D.)
Point
 Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
StartPoint
 Gets or sets the reference to Point3D startpoint of the segment.
 (Inherited from Segment3D.)
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace